[
	{
		"videoUrl": "https://player.vimeo.com/video/278304444?title=0&byline=0&portrait=0",
		"name": "Securix.IO ICO presentation",
		"tag": "Explainer videos",
		"price": "1 $",
		"time": "32 hours",
		"target": "Securix.IO wanted a well-optimized video that can increase return on investments.",
		"result": "We aspired to introduce people into the unexplored and excellent blockchain world and show a simple way to create a passive income. As a result, the video achieved a 61% increase in return on investments in six months.",
		"id": 2,
		"companyDescription": "Securix.IO is the next generation of crypto mining.",
		"description": "Nowadays there are a lot of ways how to make money. Blockchain technology is usually associated with Bitcoin and other cryptocurrencies. However, that is only the top of the iceberg. The fundamental idea of the explainer video is to demonstrate one of those ways at its best, keeping in mind the risks and daily volatile movements. The characters in the video clearly represent their target customers, so that it is easier to explain what their new product does and what benefits it has. The design is modern, the script as well as the visuals make it easy to accumulate the required information. Moreover, the style and colours stay consistent with their branding."
	},
	{
		"videoUrl": "https://player.vimeo.com/video/269146263?title=0&byline=0&portrait=0",
		"name": "Sift Wallet application",
		"tag": "Explainer videos",
		"price": "1 999 $",
		"time": "64 hours",
		"target": "Sift came to us with the objective to help them increase the number of downloads by more than 20%.",
		"result": "Like any perfect explainer video, we made considerable efforts to make the video as informative and profound to the viewers as possible to give them a clear idea of what it looks like in use and what they obtain accordingly. We managed to highlight that it is a trusty service provider that has a solution to any protection-related problems. As a result, the number of downloads increased by 22% in a few months.",
		"id": 3,
		"customer": {
			"position": "",
			"name": "Ryan Noel",
			"feedback": "Great company to work with! Animation skills are excellent and communication was great. Look forward to collaborating with them again.",
			"linkedin": "https://www.linkedin.com/in/ryancnoel/",
			"facebook": "https://www.facebook.com/ryan.noel",
			"instagram": ""
		},
		"companyDescription": "Sift is about unlocking hidden credit cards benefits like price protection and supporting other things like return, warranty, theft and damage protection.",
		"description": "The service is clearly explained. It was important to us to showcase that the service helps you make the most out of your credit card. Moreover, it makes you aware of the hidden benefits available on your credit card as well as it helps you to streamline the claim process to get your money back. The colours, style, simplicity and an airy look of the explainer video strengthen a brand identity of the company. Again, we ended the video with a call to action, because it is a perfect way to send potential clients to your website to find out more. "
	},
	{
		"videoUrl": "https://player.vimeo.com/video/218776865?title=0&byline=0&portrait=0",
		"name": "U.S. Rubber presentation ",
		"tag": "Explainer videos",
		"price": "999 $",
		"time": "32 hours",
		"target": "The team of U.S. Rubber Recycling, Inc. knocked on our door and shared their story with us. They aspired to increase conversions by 75% or more on their landing page.",
		"result": "We approached the project with a clear insight that a clean design, bright colours and a sophisticated voice-over would provide a complete picture of the tire recycling process in their strategy. Thus, in consequence of mutual efforts the conversions increased by 54% within a few weeks. Moreover, the conversions increased by 82% in a few months.",
		"id": 4,
		"companyDescription": "U.S. Rubber Recycling, Inc. is the world’s top rubber tire manufacturer in California. The company is focused on manufacturing and distributing high quality flooring and underlayment products made primarily from recycled rubber tires.",
		"description": "The video is very rich in information. Moreover, it is an outstanding example of explainer video with a problem-solution approach. The idea behind this video campaign is a simple one: to demonstrate how U.S. Rubber Recycling, Inc. established a recycling system for millions of rubber tires to avoid harmful waste tire pollution. We desired to highlight that tire pollution is a growing problem today. We can see used tires everywhere. Furthermore, it is very hazardous to our health. Thus we decided to show that the only way out of such situation is to follow the example of the company and recycle it."
	},
	{
		"videoUrl": "https://player.vimeo.com/video/273860356?title=0&byline=0&portrait=0",
		"name": "Lifemining.IO",
		"tag": "Explainer videos",
		"price": "999 $",
		"time": "32 hours",
		"target": "Lifemining.IO challenged us with revealing a simple way to promptly help improve engagement converting viewers into customers. ",
		"result": "Consequently, owing to the informative and well-structured video, a lot of viewers walked in with a better understanding of the company benefits, leading to 50% growth rate of monthly revenue.",
		"id": 5,
		"companyDescription": "Lifemining.IO is a leading cloud mining company. Being reliable and trustworthy business partners, they confine themselves to the customer-oriented approach. That is why all the customers are truly satisfied with the excellent services and considerable income.",
		"description": "The principal message of the video is to highlight that people can mine by means of emerging technology, so that they should not concern themselves with prohibitively high prices of equipment. To demonstrate how it works from the inside, we decided to describe how to get the first proceeds from mining by applying three simple steps. The figures, graphs, charts and diagrams are depicted to visualize the process as it is, because the success is indeed in a matter of seconds."
	},
	{
		"videoUrl": "https://player.vimeo.com/video/270431499?title=0&byline=0&portrait=0",
		"name": "Game Gold ICO promo",
		"tag": "Explainer videos",
		"price": "999 $",
		"time": "32 hours",
		"target": "Brand awareness is a potent tool when it comes to promoting your business. Game Gold led us to think: help them make a video that can extend its brand awareness on the internet platform.",
		"result": "Since the gaming industry is a new way of making money, it was important to centre the animation around its simplicity and high profitability. Moreover, we desired to highlight that Game Gold platform provides stability following a high degree of anonymity, low transfers fee, transparency of transactions and secure e-wallets. As a result, the video achieved a 57% increase in brand awareness within a short period of time.",
		"id": 6,
		"customer": {
			"position": "",
			"name": "Andrew Orekhov",
			"feedback": "Best ever partner! All in time and with best quality ever. Highly recommend.",
			"linkedin": "https://www.linkedin.com/in/andreworekhov/",
			"facebook": "",
			"instagram": ""
		},
		"companyDescription": "Game Gold platform is a new game cryptocurrency that is based on a Scrypt algorithm. Technically it is more perfect than Bitcoin. Moreover, Cryptocurrency Game Gold surpasses different game developers with easy integration API.",
		"description": "The central plank of the explainer video is a rapidly growing gaming industry. We highlight that everyone can undoubtedly get revenue from the computer games. In this well-designed video, we keep the colour spectrum similar to the one they have on their website. The script of the video manages to convey a required message appropriately. The bright and fun colours as well as engaging and fine-focused style keep the viewer’s interest until the end."
	},
	{
		"videoUrl": "https://player.vimeo.com/video/260584011?title=0&byline=0&portrait=0",
		"name": "The New Post presentation",
		"tag": "Explainer videos",
		"price": "999 $",
		"time": "32 hours",
		"target": "The New Post challenged us with a task to increase visibility in search in as short time as possible. ",
		"result": "We arrived at a decision to demonstrate that although The New Post has solid experience, the company provides a mix of new insights and enhanced approaches to ensure that postal services can be arranged in a simple, secure and rapid way. This not only helped the core audience feel more secure, but also it has led to a better click-through-rate by 78%. ",
		"id": 7,
		"companyDescription": "The New Post is about collecting, sorting, processing, and delivering packages, parcels and mails for both business and consumers. More than 10 million packages, parcels and mails have passed through The New Post since it opened years ago.",
		"description": "Let’s be honest, a lot of post offices do have significant problems with delay, malfunction, missed or late delivery, removal or loss of any necessary things. However, a primary goal of the explainer video is to demonstrate a new way of reliable delivery without prevarication or delays. The characters used in the explainer video and its informative style increase comprehension and highlight main points. We also maintain the same design and colours they use, so that the brand remains in our minds."
	},
	{
		"videoUrl": "https://player.vimeo.com/video/255616940?title=0&byline=0&portrait=0",
		"name": "Working at the Alex Logistics ",
		"tag": "Explainer videos",
		"price": "999 $",
		"time": "32 hours",
		"target": "To hire new qualified employees Alex Logistics needed an exciting and colourful video that reveals all advantages and benefits of the company.",
		"result": "To attract more employees to the company, we arrived at a decision to focus not only on positive and friendly environment of the company, but also on its advantages and benefits over other companies. Therefore, a lot of people were astonished by the friendly atmosphere, favourable conditions and a first-class benefits package. Subsequently, the number of received CVs has increased by more than 60%.",
		"id": 8,
		"companyDescription": "Alex Logistics is a leading logistic service provider in the US. The company is committed to providing innovative supply chain solutions to customers in a timely fashion minimizing their costs.",
		"description": "Work plays a central role in life. Even so, after 52 seconds, when the video ends, you are left with the feeling that you do want to work in the company. The video indicates a widespread problem of today’s society and emphasizes on importance of an employee-friendly working environment where staffers feel welcome to help the viewers identify themselves with the characters in the video. We opt for the modern, clean design and the script. The last line is meant to reinforce the company’s name in the viewer’s mind. So, you can watch how it all turned out."
	}
]